[
    {
        "title": "Superman",
        "overview": "Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.",
        "rating": 7.7,
        "release_date": "2025-07-09",
        "genre": [
            "Science Fiction",
            "Adventure",
            "Action"
        ]
    },
    {
        "title": "How to Train Your Dragon",
        "overview": "On the rugged isle of Berk, where Vikings and dragons have been bitter enemies for generations, Hiccup stands apart, defying centuries of tradition when he befriends Toothless, a feared Night Fury dragon. Their unlikely bond reveals the true nature of dragons, challenging the very foundations of Viking society.",
        "rating": 8.0,
        "release_date": "2025-06-06",
        "genre": [
            "Fantasy",
            "Family",
            "Action",
            "Adventure"
        ]
    },
    {
        "title": "The Pickup",
        "overview": "A routine cash pickup takes a wild turn when mismatched armored truck drivers Russell and Travis are ambushed by ruthless criminals led by savvy mastermind Zoe.",
        "rating": 6.543,
        "release_date": "2025-07-27",
        "genre": [
            "Action",
            "Comedy",
            "Crime"
        ]
    },
    {
        "title": "Weapons",
        "overview": "When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance.",
        "rating": 7.623,
        "release_date": "2025-08-04",
        "genre": [
            "Horror",
            "Mystery"
        ]
    },
    {
        "title": "Lilo & Stitch",
        "overview": "The wildly funny and touching story of a lonely Hawaiian girl and the fugitive alien who helps to mend her broken family.",
        "rating": 7.322,
        "release_date": "2025-05-17",
        "genre": [
            "Family",
            "Science Fiction",
            "Comedy",
            "Adventure"
        ]
    },
    {
        "title": "M3GAN 2.0",
        "overview": "After the underlying tech for M3GAN is stolen and misused by a powerful defense contractor to create a military-grade weapon known as Amelia, M3GAN's creator Gemma realizes that the only option is to resurrect M3GAN and give her a few upgrades, making her faster, stronger, and more lethal.",
        "rating": 7.593,
        "release_date": "2025-06-25",
        "genre": [
            "Action",
            "Science Fiction",
            "Thriller"
        ]
    },
    {
        "title": "The Fantastic 4: First Steps",
        "overview": "Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.",
        "rating": 7.247,
        "release_date": "2025-07-23",
        "genre": [
            "Science Fiction",
            "Adventure"
        ]
    },
    {
        "title": "My Oxford Year",
        "overview": "An ambitious American fulfilling her dream of studying at Oxford falls for a charming Brit hiding a secret that may upend her perfectly planned life.",
        "rating": 7.259,
        "release_date": "2025-07-31",
        "genre": [
            "Romance",
            "Comedy",
            "Drama"
        ]
    },
    {
        "title": "KPop Demon Hunters",
        "overview": "When K-pop superstars Rumi, Mira and Zoey aren't selling out stadiums, they're using their secret powers to protect their fans from supernatural threats.",
        "rating": 8.42,
        "release_date": "2025-06-20",
        "genre": [
            "Animation",
            "Music",
            "Action",
            "Fantasy",
            "Comedy"
        ]
    },
    {
        "title": "Karate Kid: Legends",
        "overview": "After a family tragedy, kung fu prodigy Li Fong is uprooted from his home in Beijing and forced to move to New York City with his mother. When a new friend needs his help, Li enters a karate competition – but his skills alone aren't enough. Li's kung fu teacher Mr. Han enlists original Karate Kid Daniel LaRusso for help, and Li learns a new way to fight, merging their two styles into one for the ultimate martial arts showdown.",
        "rating": 7.157,
        "release_date": "2025-05-08",
        "genre": [
            "Action",
            "Adventure",
            "Drama"
        ]
    },
    {
        "title": "28 Years Later",
        "overview": "Twenty-eight years since the rage virus escaped a biological weapons laboratory, now, still in a ruthlessly enforced quarantine, some have found ways to exist amidst the infected. One such group lives on a small island connected to the mainland by a single, heavily-defended causeway. When one member departs on a mission into the dark heart of the mainland, he discovers secrets, wonders, and horrors that have mutated not only the infected but other survivors as well.",
        "rating": 6.83,
        "release_date": "2025-06-18",
        "genre": [
            "Horror",
            "Thriller",
            "Science Fiction"
        ]
    },
    {
        "title": "Ice Road: Vengeance",
        "overview": "Big rig ice road driver Mike McCann travels to Nepal to scatter his late brother’s ashes on Mt. Everest. While on a packed tour bus traversing the deadly 12,000 ft. terrain of the infamous Road to the Sky, McCann and his mountain guide encounter a group of mercenaries and must fight to save themselves, the busload of innocent travelers, and the local villagers’ homeland.",
        "rating": 6.876,
        "release_date": "2025-06-27",
        "genre": [
            "Action",
            "Thriller",
            "Drama"
        ]
    },
    {
        "title": "Ballerina",
        "overview": "Taking place during the events of John Wick: Chapter 3 – Parabellum, Eve Macarro begins her training in the assassin traditions of the Ruska Roma.",
        "rating": 7.438,
        "release_date": "2025-06-04",
        "genre": [
            "Action",
            "Thriller",
            "Crime"
        ]
    },
    {
        "title": "Happy Gilmore 2",
        "overview": "Happy Gilmore isn't done with golf — not by a long shot. Since his retirement after his first Tour Championship win, Gilmore returns to finance his daughter's ballet classes.",
        "rating": 6.741,
        "release_date": "2025-07-25",
        "genre": [
            "Comedy"
        ]
    },
    {
        "title": "Final Destination Bloodlines",
        "overview": "Plagued by a violent recurring nightmare, college student Stefanie heads home to track down the one person who might be able to break the cycle and save her family from the grisly demise that inevitably awaits them all.",
        "rating": 7.2,
        "release_date": "2025-05-14",
        "genre": [
            "Horror",
            "Mystery"
        ]
    },
    {
        "title": "Eddington",
        "overview": "In May of 2020, a standoff between a small-town sheriff and mayor sparks a powder keg as neighbor is pitted against neighbor in Eddington, New Mexico.",
        "rating": 6.634,
        "release_date": "2025-07-16",
        "genre": [
            "Western",
            "Comedy",
            "Crime"
        ]
    },
    {
        "title": "Mission: Impossible - The Final Reckoning",
        "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
        "rating": 7.153,
        "release_date": "2025-05-17",
        "genre": [
            "Action",
            "Adventure",
            "Thriller"
        ]
    },
    {
        "title": "Thunderbolts*",
        "overview": "After finding themselves ensnared in a death trap, seven disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts.",
        "rating": 7.4,
        "release_date": "2025-04-30",
        "genre": [
            "Action",
            "Science Fiction",
            "Adventure"
        ]
    },
    {
        "title": "F1",
        "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
        "rating": 7.6,
        "release_date": "2025-06-25",
        "genre": [
            "Action",
            "Drama"
        ]
    },
    {
        "title": "Bring Her Back",
        "overview": "Following the death of their father, a brother and sister are introduced to their new sibling by their foster mother, only to learn that she has a terrifying secret.",
        "rating": 7.5,
        "release_date": "2025-05-28",
        "genre": [
            "Horror"
        ]
    },
    {
        "title": "Fight Club",
        "overview": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
        "rating": 8.437,
        "release_date": "1999-10-15",
        "genre": [
            "Drama",
            "Thriller"
        ]
    },
    {
        "title": "How to Train Your Dragon 2",
        "overview": "Five years have passed since Hiccup and Toothless united the dragons and Vikings of Berk. Now, they spend their time charting unmapped territories. During one of their adventures, the pair discover a secret cave that houses hundreds of wild dragons -- and a mysterious dragon rider. Hiccup and Toothless find themselves at the center of a battle to protect Berk from a power-hungry warrior.",
        "rating": 7.676,
        "release_date": "2014-06-05",
        "genre": [
            "Fantasy",
            "Action",
            "Adventure",
            "Animation",
            "Comedy",
            "Family"
        ]
    },
    {
        "title": "Jurassic World",
        "overview": "Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.",
        "rating": 6.7,
        "release_date": "2015-06-06",
        "genre": [
            "Action",
            "Adventure",
            "Science Fiction",
            "Thriller"
        ]
    },
    {
        "title": "Coraline",
        "overview": "Wandering her rambling old house in her boring new town, 11-year-old Coraline discovers a hidden door to a strangely idealized version of her life. In order to stay in the fantasy, she must make a frighteningly real sacrifice.",
        "rating": 7.897,
        "release_date": "2009-02-05",
        "genre": [
            "Animation",
            "Family",
            "Fantasy"
        ]
    },
    {
        "title": "Harry Potter and the Order of the Phoenix",
        "overview": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students to defend themselves against the dark arts.",
        "rating": 7.7,
        "release_date": "2007-07-08",
        "genre": [
            "Adventure",
            "Fantasy"
        ]
    },
    {
        "title": "The Life of Chuck",
        "overview": "In this extraordinary story of an ordinary man, Charles 'Chuck' Krantz experiences the wonder of love, the heartbreak of loss, and the multitudes contained in all of us.",
        "rating": 7.346,
        "release_date": "2025-06-05",
        "genre": [
            "Science Fiction",
            "Fantasy",
            "Drama"
        ]
    },
    {
        "title": "How to Train Your Dragon",
        "overview": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father.",
        "rating": 7.851,
        "release_date": "2010-03-18",
        "genre": [
            "Fantasy",
            "Adventure",
            "Animation",
            "Family"
        ]
    },
    {
        "title": "Iron Man",
        "overview": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
        "rating": 7.653,
        "release_date": "2008-04-30",
        "genre": [
            "Action",
            "Science Fiction",
            "Adventure"
        ]
    },
    {
        "title": "Below Her Mouth",
        "overview": "An unexpected affair quickly escalates into a heart-stopping reality for two women whose passionate connection changes their lives forever.",
        "rating": 6.803,
        "release_date": "2017-02-10",
        "genre": [
            "Drama",
            "Romance"
        ]
    },
    {
        "title": "How to Train Your Dragon: The Hidden World",
        "overview": "As Hiccup fulfills his dream of creating a peaceful dragon utopia, Toothless’ discovery of an untamed, elusive mate draws the Night Fury away. When danger mounts at home and Hiccup’s reign as village chief is tested, both dragon and rider must make impossible decisions to save their kind.",
        "rating": 7.75,
        "release_date": "2019-01-03",
        "genre": [
            "Animation",
            "Family",
            "Adventure"
        ]
    },
    {
        "title": "John Wick: Chapter 4",
        "overview": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.",
        "rating": 7.721,
        "release_date": "2023-03-22",
        "genre": [
            "Action",
            "Thriller",
            "Crime"
        ]
    },
    {
        "title": "Smile 2",
        "overview": "About to embark on a new world tour, global pop sensation Skye Riley begins experiencing increasingly terrifying and inexplicable events. Overwhelmed by the escalating horrors and the pressures of fame, Skye is forced to face her dark past to regain control of her life before it spirals out of control.",
        "rating": 6.596,
        "release_date": "2024-10-16",
        "genre": [
            "Horror",
            "Mystery"
        ]
    },
    {
        "title": "Toy Story 2",
        "overview": "Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, owner of Al's Toy Barn kidnaps Woody. Andy's toys mount a daring rescue mission, Buzz Lightyear meets his match and Woody has to decide where he and his heart truly belong.",
        "rating": 7.602,
        "release_date": "1999-10-30",
        "genre": [
            "Animation",
            "Comedy",
            "Family"
        ]
    },
    {
        "title": "Se7en",
        "overview": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Somerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
        "rating": 8.4,
        "release_date": "1995-09-22",
        "genre": [
            "Crime",
            "Mystery",
            "Thriller"
        ]
    },
    {
        "title": "Harry Potter and the Deathly Hallows: Part 2",
        "overview": "Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wizards, Harry discovers a trio of magical objects that endow him with powers to rival Voldemort's formidable skills.",
        "rating": 8.1,
        "release_date": "2011-07-12",
        "genre": [
            "Fantasy",
            "Adventure"
        ]
    },
    {
        "title": "The Matrix",
        "overview": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
        "rating": 8.23,
        "release_date": "1999-03-31",
        "genre": [
            "Action",
            "Science Fiction"
        ]
    },
    {
        "title": "The Incredibles",
        "overview": "Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
        "rating": 7.714,
        "release_date": "2004-10-27",
        "genre": [
            "Action",
            "Adventure",
            "Animation",
            "Family"
        ]
    },
    {
        "title": "Jurassic World: Fallen Kingdom",
        "overview": "Three years after Jurassic World was destroyed, Isla Nublar now sits abandoned. When the island's dormant volcano begins roaring to life, Owen and Claire mount a campaign to rescue the remaining dinosaurs from this extinction-level event.",
        "rating": 6.54,
        "release_date": "2018-06-06",
        "genre": [
            "Action",
            "Adventure",
            "Science Fiction",
            "Thriller"
        ]
    },
    {
        "title": "The Conjuring: The Devil Made Me Do It",
        "overview": "Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.",
        "rating": 7.402,
        "release_date": "2021-05-25",
        "genre": [
            "Horror",
            "Mystery",
            "Thriller"
        ]
    },
    {
        "title": "Barbie",
        "overview": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans.",
        "rating": 6.966,
        "release_date": "2023-06-18",
        "genre": [
            "Comedy",
            "Adventure"
        ]
    }
]